#Pandas Practical -04

#how to write csv file

In [2]:
import pandas as pd

In [4]:
df=pd.read_csv('D:\\Movies\\BOLLYWOOD\\Flames\\Book2.csv')
df

  Student_id  class  sleep_hr  math  science  marathi  hindi  total
0      S0001      7         6    60       90       78     56     67
1      S0002      5         4    90       60       67     78     76
2      S0003      6         6    70       70       56     98     56
3      S0004      9         8    50       80       34     43     89
4      S0005      3         5    50       80       89     53     76
5      S0006      6         5    60       80       76     63     49
6      S0007      2         5    60       89       56     73     78

In [5]:
type(df)

pandas.core.frame.DataFrame

#To get heading of the column

In [6]:
df.columns

Index(['Student_id', 'class', 'sleep_hr', 'math', 'science', 'marathi',
       'hindi', 'total'],
      dtype='object')

#To get no of rows as per our requirement

In [7]:
df=pd.read_csv('D:\\Movies\\BOLLYWOOD\\Flames\\Book2.csv',nrows=5)
df

  Student_id  class  sleep_hr  math  science  marathi  hindi  total
0      S0001      7         6    60       90       78     56     67
1      S0002      5         4    90       60       67     78     76
2      S0003      6         6    70       70       56     98     56
3      S0004      9         8    50       80       34     43     89
4      S0005      3         5    50       80       89     53     76

#To get no of columns as per our requirement

In [9]:
df=pd.read_csv('D:\\Movies\\BOLLYWOOD\\Flames\\Book2.csv',usecols=[0,1,3])
df

  Student_id  class  math
0      S0001      7    60
1      S0002      5    90
2      S0003      6    70
3      S0004      9    50
4      S0005      3    50
5      S0006      6    60
6      S0007      2    60

#To skip the rows from upper

In [12]:
df=pd.read_csv('D:\\Movies\\BOLLYWOOD\\Flames\\Book2.csv',skiprows=1)
df

   S0001  7  6  60  90  78  56  67
0  S0002  5  4  90  60  67  78  76
1  S0003  6  6  70  70  56  98  56
2  S0004  9  8  50  80  34  43  89
3  S0005  3  5  50  80  89  53  76
4  S0006  6  5  60  80  76  63  49
5  S0007  2  5  60  89  56  73  78

In [13]:
df=pd.read_csv('D:\\Movies\\BOLLYWOOD\\Flames\\Book2.csv',skiprows=5)
df

   S0005  3  5  50  80  89  53  76
0  S0006  6  5  60  80  76  63  49
1  S0007  2  5  60  89  56  73  78

#To skip the Specific rows

In [16]:
df=pd.read_csv('D:\\Movies\\BOLLYWOOD\\Flames\\Book2.csv',skiprows=[1,3,4])
df

  Student_id  class  sleep_hr  math  science  marathi  hindi  total
0      S0002      5         4    90       60       67     78     76
1      S0005      3         5    50       80       89     53     76
2      S0006      6         5    60       80       76     63     49
3      S0007      2         5    60       89       56     73     78

#To make the specific column as index

In [17]:
df=pd.read_csv('D:\\Movies\\BOLLYWOOD\\Flames\\Book2.csv',index_col='class')
df

      Student_id  sleep_hr  math  science  marathi  hindi  total
class
7          S0001         6    60       90       78     56     67
5          S0002         4    90       60       67     78     76
6          S0003         6    70       70       56     98     56
9          S0004         8    50       80       34     43     89
3          S0005         5    50       80       89     53     76
6          S0006         5    60       80       76     63     49
2          S0007         5    60       89       56     73     78

In [18]:
df=pd.read_csv('D:\\Movies\\BOLLYWOOD\\Flames\\Book2.csv',index_col=3)
df

     Student_id  class  sleep_hr  science  marathi  hindi  total
math
60        S0001      7         6       90       78     56     67
90        S0002      5         4       60       67     78     76
70        S0003      6         6       70       56     98     56
50        S0004      9         8       80       34     43     89
50        S0005      3         5       80       89     53     76
60        S0006      6         5       80       76     63     49
60        S0007      2         5       89       56     73     78